# -----------------------1--------------------------------------------
name = str(input("Введите ваше имя: "))
print("Привет,", name)

n = int(input("Введите число: "))
y = n * 12
print(y)


# -----------------------2--------------------------------------------

time = int(input("Введите число: "))
time = time % (24 * 3600)
hour = time // 3600
time %= 3600
minutes = time // 60
time %= 60
seconds = time
print(f"{hour:02}:{minutes:02}:{seconds:02}")

# -----------------------3--------------------------------------------

n = int(input("Введите число n: "))
temp = str(n)
t1 = temp + temp
t2 = temp + temp + temp
comp = n + int(t1) + int(t2)
print("Результат равен:", comp)

# -----------------------4--------------------------------------------

a = int(input())
m = a%10
a = a//10
while a > 0:
    if a%10 > m:
        m = a%10
    a = a//10
print(m)

# -----------------------5--------------------------------------------

profit = int(input("Введите выручку фирмы "))
costs = int(input("Введите издержки фирмы "))
if profit > costs:
    print(f"Фирма работает с прибылью. Рентабельность выручки составила {profit / costs:.2f}")
    workers = int(input("Введите количество сотрудников фирмы "))
    print(f"прибыль в расчете на одного сторудника сотавила {(profit - costs) / workers:.2f}")
elif profit == costs:
    print("Фирма работает в ноль")
else:
    print("Фирма работает в убыток")

# -----------------------6--------------------------------------------

print("Введите x:")
x = int(input())
print("Введите y:")
y = int(input())
s = x
k = 1
while s <= y:
    k = k+1
    s = 1.1*s
print("k = ", k, end = '')
